Config/Catalogs/ПервичныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПервичныеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ПервичныеДокументыБГУ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Параметры заполнения первичных документов.
// 
// Возвращаемое значение:
//  Структура - Параметры заполнения первичных документов:
// * ДобавлятьДокументКонтрагента - Булево - 
// * УсловиеВидимостиДокументаКонтрагента - Неопределено 
// * ДобавлятьАктПриемкиТоваровРаботУслуг - Булево - 
// * УсловиеВидимостиАктаПриемкиТоваровРаботУслуг - Неопределено
Функция ПараметрыЗаполненияПервичныхДокументов() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("ДобавлятьДокументКонтрагента", Ложь);
	Параметры.Вставить("УсловиеВидимостиДокументаКонтрагента", Неопределено);
	Параметры.Вставить("ДобавлятьАктПриемкиТоваровРаботУслуг", Ложь);
	Параметры.Вставить("УсловиеВидимостиАктаПриемкиТоваровРаботУслуг", Неопределено);
	Возврат Параметры;
КонецФункции

// Заполняет список выбора реквизита "ПервичныйДокумент" 
// и данные печатных форм для первичных документов в реквизит формы "ПераметрыПечатныхФорм".
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ДобавлятьДокументКонтрагента - Булево - Добавлять первичный документ "Документ контрагента"
//  							 - см. ПараметрыЗаполненияПервичныхДокументов
//  УсловиеВидимостиДокументаКонтрагента - Массив из Строка, Неопределено - Условие видимости документа контрагента
//  СписокОбъектов - Массив из ОбъектМетаданных - коллекция объектов метаданных, команды печати которых необходимо использовать при составлении
//                            списка команд печати для указанной формы.
Процедура ПриСозданииНаСервере(Форма, ДобавлятьДокументКонтрагента = Ложь, 
	УсловиеВидимостиДокументаКонтрагента = Неопределено, СписокОбъектов = Неопределено) Экспорт
	
	Если ТипЗнч(ДобавлятьДокументКонтрагента) = Тип("Структура") Тогда
		ЗначениеДобавлятьДокументКонтрагента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДобавлятьДокументКонтрагента, "ДобавлятьДокументКонтрагента", Ложь); // Булево
		ЗначениеУсловиеВидимостиДокументаКонтрагента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДобавлятьДокументКонтрагента, "УсловиеВидимостиДокументаКонтрагента");
		ЗначениеДобавлятьАктПриемкиТоваровРаботУслуг = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДобавлятьДокументКонтрагента, "ДобавлятьАктПриемкиТоваровРаботУслуг", Ложь); // Булево
		ЗначениеУсловиеВидимостиАктаПриемкиТоваровРаботУслуг = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДобавлятьДокументКонтрагента, "УсловиеВидимостиАктаПриемкиТоваровРаботУслуг");
	Иначе
		ЗначениеДобавлятьДокументКонтрагента = ДобавлятьДокументКонтрагента;
		ЗначениеУсловиеВидимостиДокументаКонтрагента = УсловиеВидимостиДокументаКонтрагента;
		ЗначениеДобавлятьАктПриемкиТоваровРаботУслуг = Ложь;
		ЗначениеУсловиеВидимостиАктаПриемкиТоваровРаботУслуг = Неопределено;
	КонецЕсли;
	
	ТаблицаКоманд = УправлениеПечатью.КомандыПечатиФормы(Форма, СписокОбъектов);
	ПечатныеФормы = Новый Структура;
	
	Для Каждого Строка Из ТаблицаКоманд Цикл
		ВидПервичногоДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Строка.ДополнительныеПараметры, "ВидПервичногоДокумента");
		Если Не ЗначениеЗаполнено(ВидПервичногоДокумента) Тогда
			Продолжить;
		КонецЕсли;
		ПечатнаяФорма = ПустаяСтрокаПараметраПечатныхФорм();
		ПечатнаяФорма.ВидПервичногоДокумента = НайтиПоИдентификатору(Строка.Идентификатор);
		ПечатнаяФорма.Представление = Строка.Представление;
		ПечатнаяФорма.УсловияВидимости = Строка.УсловияВидимости;
		УстановитьОсобоеУсловиеВидимостиКоманды(Строка.Идентификатор, ПечатнаяФорма);
		
		ПечатныеФормы.Вставить(Строка.Идентификатор, ПечатнаяФорма);
	КонецЦикла;
	
	Если ЗначениеДобавлятьДокументКонтрагента Тогда
		Если ЗначениеУсловиеВидимостиДокументаКонтрагента = Неопределено Тогда
			ЗначениеУсловиеВидимостиДокументаКонтрагента = Новый Массив;
		КонецЕсли;
		
		ПечатнаяФорма = ПустаяСтрокаПараметраПечатныхФорм();
		ПечатнаяФорма.ВидПервичногоДокумента = ПервичныйДокументДокументКонтрагента();
		ПечатнаяФорма.Представление = НСтр("ru = 'Документ контрагента'");
		ПечатнаяФорма.УсловияВидимости = УсловиеВидимостиДокументаКонтрагента;
		ПечатныеФормы.Вставить("ДокументКонтрагента", ПечатнаяФорма);
	КонецЕсли;
	
	Если ЗначениеДобавлятьАктПриемкиТоваровРаботУслуг Тогда
		Если ЗначениеУсловиеВидимостиАктаПриемкиТоваровРаботУслуг = Неопределено Тогда
			ЗначениеУсловиеВидимостиАктаПриемкиТоваровРаботУслуг = Новый Массив;
		КонецЕсли;
		ПечатнаяФорма = ПустаяСтрокаПараметраПечатныхФорм();
		ПечатнаяФорма.ВидПервичногоДокумента = ПервичныйДокументАктПриемкиТРУ();
		ПечатнаяФорма.Представление = НСтр("ru = 'Акт приемки товаров, работ, услуг (ф. 0510452)'");
		ПечатнаяФорма.УсловияВидимости = ЗначениеУсловиеВидимостиАктаПриемкиТоваровРаботУслуг;
		ПечатныеФормы.Вставить("ДокументАктПриемкиТоваровРаботУслуг", ПечатнаяФорма);
	КонецЕсли;
	
	Форма.ПараметрыПечатныхФорм = ПечатныеФормы;
	ПервичныеДокументыБГУКлиентСервер.ОбновитьВидыПервичныхДокументов(Форма);
КонецПроцедуры

// Представление первичного документа.
// 
// Параметры:
//  ПервичныйДокумент - СправочникСсылка.ПервичныеДокументы
// 
// Возвращаемое значение:
//  Строка
Функция ВидПервичногоДокумента(ПервичныйДокумент) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервичныйДокумент, "ВидПервичногоДокумента");
КонецФункции

// Добавляет условие видимости команды печати по выбранному в документе Первичному документу.
// ИдентификаторПечатнойФормы следует передавать явно, если это дополнительная команда печати,
// которая доступна в дополнение к печатной форме первичного документа.
// Например, чтобы ограничить устаревшие печатные формы, которые не должны быть доступны, когда выбран первичный документ.
// Но которые сами не включаются в список первичных документов.
// 
// Если РазрешитьСДокументомКонтрагента=Истина, будет добавлено условие на первичный документ "Документ контрагента".
// 
// Параметры:
//  КомандаПечати - СтрокаТаблицыЗначений: см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//  ИдентификаторПечатнойФормы - Строка - если не передана, то берется из КомандыПечати.
//  РазрешитьСДокументомКонтрагента - Булево - Форма используется если выбрано значение "ДокументКонтрагента"
Процедура ДобавитьУсловиеКомандыПечати(КомандаПечати, ИдентификаторПечатнойФормы = "", РазрешитьСДокументомКонтрагента = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторПечатнойФормы) Тогда
		ПервичныйДокумент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			КомандаПечати.ДополнительныеПараметры, "ВидПервичногоДокумента", "");
	Иначе	
		ПервичныйДокумент = НайтиПоИдентификатору(ИдентификаторПечатнойФормы);
	КонецЕсли;

	Условия = Новый СписокЗначений;
	Условия.Добавить(Справочники.ПервичныеДокументы.ПустаяСсылка());
	Если РазрешитьСДокументомКонтрагента Тогда
		Условия.Добавить(Справочники.ПервичныеДокументы.ПустаяСсылка());
	КонецЕсли;
	Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		Условия.Добавить(ПервичныйДокумент);
	КонецЕсли;
	
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
		"ПервичныйДокумент",
		Условия,
		ВидСравнения.ВСписке);
	
КонецПроцедуры

// Установить вид первичного документа команды печати.
// 
// Параметры:
//  КомандаПечати - СтрокаТаблицыЗначений: см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//  ДобавитьУсловие - Булево - добавить условие видимости команды
//  РазрешитьСДокументомКонтрагента - Булево - Форма используется если выбрано значение "ДокументКонтрагента"
Процедура УстановитьСвойстваКомандыПечати(КомандаПечати, ДобавитьУсловие = Истина, РазрешитьСДокументомКонтрагента = Ложь) Экспорт
	
	ВидПервичногоДокумента = НайтиПоИдентификатору(КомандаПечати.Идентификатор);
	Если ЗначениеЗаполнено(ВидПервичногоДокумента) Тогда
		КомандаПечати.ДополнительныеПараметры.Вставить("ВидПервичногоДокумента", ВидПервичногоДокумента);
	КонецЕсли;
	Если ДобавитьУсловие Тогда
		ДобавитьУсловиеКомандыПечати(КомандаПечати, "", РазрешитьСДокументомКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает первичный документ по идентификатору.
// 
// Параметры:
//  Идентификатор - Строка - Идентификатор
// 
// Возвращаемое значение:
//  СправочникСсылка.ПервичныеДокументы - Найти по идентификатору
Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Справочники.ПервичныеДокументы.ПустаяСсылка();
	КонецЕсли;
	ПервичныйДокумент = Справочники.ПервичныеДокументы.НайтиПоИдентификатору(Идентификатор, Ложь);
	Если Не ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		ПервичныйДокумент = Справочники.ПервичныеДокументы.СоздатьЭлементПоИдентификатору(Идентификатор);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Поиск первичного документа'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.ПервичныеДокументы,
			,
			СтрШаблон(НСтр("ru = 'Не найден первичный документ по идентификатору: %1'"), Идентификатор));
	КонецЕсли;
	Возврат ПервичныйДокумент;
КонецФункции

// Описания первичных документов.
// В описания добавляются первичные документы из модуля ПервичныеДокументыБГУПереопределяемый.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Описания первичных документов:
// * Идентификатор - Строка - 
// * ВидПервичногоДокумента - Строка - 
// * Наименование - Строка - 
Функция ОписанияПервичныхДокументов() Экспорт
	
	ПервичныеДокументы = НовыйОписаниеПервичныхДокументов();
	ДобавитьПоставляемыеОписанияПервичныхДокументов(ПервичныеДокументы);
	ПервичныеДокументыБГУПереопределяемый.ДобавитьПоставляемыеОписанияПервичныхДокументов(ПервичныеДокументы);
	Возврат ПервичныеДокументы;
	
КонецФункции

// Первичный документ - "Документ контрагента".
// 
// Возвращаемое значение:
//  СправочникСсылка.ПервичныеДокументы - Первичный документ документ контрагента
Функция ПервичныйДокументДокументКонтрагента() Экспорт
	Возврат НайтиПоИдентификатору(СлужебныйИдентификаторДокументКонтагента());
КонецФункции

// Идентификатор для поиска первичного документа "Документ контагента".
// 
// Возвращаемое значение:
//  Строка - Служебный идентификатор документ контагента
Функция СлужебныйИдентификаторДокументКонтагента() Экспорт
	Возврат "ДокументКонтрагента_Служебный";
КонецФункции

// Первичный документ - "Акт приемки товаров, работ, услуг".
// 
// Возвращаемое значение:
//  СправочникСсылка.ПервичныеДокументы - Первичный документ Акт приемки товаров, работ, услуг
Функция ПервичныйДокументАктПриемкиТРУ() Экспорт
	Возврат НайтиПоИдентификатору(СлужебныйИдентификаторАктПриемкиТРУ());
КонецФункции

// Идентификатор для поиска первичного документа "Акт приемки товаров, работ, услуг".
// 
// Возвращаемое значение:
//  Строка - Служебный идентификатор Акт приемки товаров, работ, услуг
Функция СлужебныйИдентификаторАктПриемкиТРУ() Экспорт
	Возврат "АктПриемкиТРУ_Служебный";
КонецФункции

// Добавить описание первичного документа в таблицу первичных документов
// 
// Параметры:
//  ПервичныеДокументы - см. НовыйОписаниеПервичныхДокументов 
//  Идентификатор - Строка - Идентификатор
//  ВидПервичногоДокумента - Строка - Вид первичного документа
//  Наименование - Строка - Наименование
Процедура ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы, Идентификатор, ВидПервичногоДокумента, Наименование) Экспорт
	НоваяСтрока = ПервичныеДокументы.Добавить();
	НоваяСтрока.Идентификатор = Идентификатор;
	НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
	НоваяСтрока.Наименование = Наименование;
КонецПроцедуры

// Команды печати первичных документов формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Объекты - Неопределено, Массив из ОбъектМетаданных - Объекты
// 
// Возвращаемое значение:
//  см. УправлениеПечатью.КомандыПечатиФормы  
Функция КомандыПечатиПервичныхДокументовФормы(Форма, Объекты = Неопределено) Экспорт
	ТаблицаКоманд = УправлениеПечатью.КомандыПечатиФормы(Форма, Объекты);
	ТолькоПервичныеДокументы = Новый Массив;
	Для Каждого Строка Из ТаблицаКоманд Цикл
		Если Строка.ДополнительныеПараметры.Свойство("ВидПервичногоДокумента")
				И ЗначениеЗаполнено(Строка.ДополнительныеПараметры.ВидПервичногоДокумента) Тогда
			ТолькоПервичныеДокументы.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаКоманд.Скопировать(ТолькоПервичныеДокументы);
КонецФункции

#Область ПолучениеПредставленийПервичныхДокументов

// Формирует представления первичных документов по идентификаторам
//
// Параметры:
//  Идентификатор - Строка - идентификатор печатной формы первичного документа. Например, "АктПриемаПередачи0510448"
//  			  - Массив из Строка - массив идентификаторов печатных форм 
//
// Возвращаемое значение:
//  - Структура - ключем является идентификатор печатной формы, значением является структура, содержащая два элемента:
//                "ПредставлениеФормы", "ПредставлениеКомандыПечати"
Функция ПредставленияПервичныхДокументов(Идентификатор) Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПервичныеДокументы.Идентификатор,
	|	ПервичныеДокументы.Наименование КАК ПредставлениеКомандыПечати,
	|	ПервичныеДокументы.ВидПервичногоДокумента КАК ПредставлениеФормы
	|ИЗ
	|	Справочник.ПервичныеДокументы КАК ПервичныеДокументы
	|ГДЕ
	|	ПервичныеДокументы.Идентификатор В (&Идентификаторы)";

	Идентификаторы = Идентификатор;
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификаторы = Новый Массив;
		Идентификаторы.Добавить(Идентификатор);
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура;
	Для каждого ТекИдентификатор из Идентификаторы Цикл
		Результат.Вставить(ТекИдентификатор, Новый Структура("ПредставлениеФормы, ПредставлениеКомандыПечати"));
		Если Выборка.НайтиСледующий(ТекИдентификатор, "Идентификатор") Тогда
			ЗаполнитьЗначенияСвойств(Результат[ТекИдентификатор], Выборка);
		Иначе	
			ЗаполнитьЗначенияСвойств(
				Результат[ТекИдентификатор], ПредставленияПервичногоДокументаПоУмолчанию(ТекИдентификатор));
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставленияПервичногоДокументаПоУмолчанию(Идентификатор)
	Результат = Новый Структура("ПредставлениеФормы, ПредставлениеКомандыПечати");
	Если Идентификатор = "Форма0510466" Тогда
		Результат.ПредставлениеФормы = НСтр("ru='Инвентаризационная опись по объектам НФА'");
		Результат.ПредставлениеКомандыПечати = НСтр("ru='Инвентаризационная опись по объектам НФА (ф. 0510466)'");
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

// Устанавливает условия видимости команд, которые не могут быть заданы обычным способом
//
// Параметры:
//  Идентификатор	 - Строка - 
//  ПечатнаяФорма	 - см. ПустаяСтрокаПараметраПечатныхФорм
//
Процедура УстановитьОсобоеУсловиеВидимостиКоманды(Идентификатор, ПечатнаяФорма)
	Если Идентификатор = "АктПриемаПередачи0510448" Тогда
		// Акт приема передачи в приходных документах должен быть виден
		// при любом значении реквизита "НФАПереданыЭлектроннымАктом".
		// При этом соответствующая команда печати должна учитывать значение флага.
		// Поэтому в команде печати условие по реквизиту "НФАПереданыЭлектроннымАктом" есть,
		// а в условиях видимости первичного документа условие удаляется.
		Если ТипЗнч(ПечатнаяФорма.УсловияВидимости) = Тип("Массив") Тогда
			Для Индекс = 0 По ПечатнаяФорма.УсловияВидимости.ВГраница() Цикл
				Если ПечатнаяФорма.УсловияВидимости[Индекс].Реквизит = "НФАПереданыЭлектроннымАктом" Тогда
					ПечатнаяФорма.УсловияВидимости.Удалить(Индекс);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоставляемыеОписанияПервичныхДокументов(ПервичныеДокументы)
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		СлужебныйИдентификаторАктПриемкиТРУ(),
		"Акт приемки товаров, работ, услуг",
		"Акт приемки товаров, работ, услуг (ф. 0140452)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		СлужебныйИдентификаторДокументКонтагента(),
		"Документ контрагента",
		"Документ контрагента");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Акт0510434",
		"Акт приема-передачи объектов, полученных в личное пользование",
		"Акт приема-передачи в личное пользование (ф. 0510434) (61н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктОСписанииБСО0510461_157н",
		"Акт о списании бланков строгой отчетности",
		"Акт списания БСО (ф. 0510461) (61н, ред. 157н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктОСписанииМЗ0510460_157н",
		"Акт о списании материальных запасов",
		"Акт о списании МЗ (ф. 0510460) (61н, ред. 157н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0504101_103н",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф. 0504101) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0504101_МЗ",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф. 0504101) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0504101_МЗ_103н",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф. 0504101) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0504101_МЗ_103н_ПоСебестоимости",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф. 0504101) (52н, ред. 103н) (по себестоимости)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0504101_МЗ_ПоСебестоимости",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф. 0504101) (52н) (по себестоимости)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0510448",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф.0510448) (61н, ред. 100н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктПриемаПередачи0510448ПоСебестоимости",
		"Акт о приеме-передаче объектов нефинансовых активов",
		"Акт о приеме-передаче НФА (ф. 0510448) (61н, ред. 100н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктСписания0510454",
		"Акт о списании объектов нефинансовых активов",
		"Акт о списании объектов НФА (ф. 0510454) (61н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктСписания0504104_103н",
		"Акт о списании объектов нефинансовых активов",
		"Акт о списании объектов НФА (ф. 0504104) (52н, ред.103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Акт0510456",
		"Акт о списании транспортного средства",
		"Акт о списании транспортного средства (ф. 0510456) (61н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ф0504105_103н",
		"Акт о списании транспортного средства",
		"Акт о списании транспортного средства (ф. 0504105) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктСписанияМЗ0504143_103н",
		"Акт о списании мягкого и хозяйственного инвентаря",
		"Акт о списании мягкого и хоз. инвентаря (ф. 0504143) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктСписанияМЗ0504143_52н",
		"Акт о списании мягкого и хозяйственного инвентаря",
		"Акт о списании мягкого и хоз. инвентаря (ф. 0504143) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктСписанияМЗ0504230_103н",
		"Акт о списании материальных запасов",
		"Акт о списании МЗ (ф. 0504230) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"АктСписанияМЗ0504230_52н",
		"Акт о списании материальных запасов",
		"Акт о списании МЗ (ф. 0504230) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Ведомость0504210_103н",
		"Ведомость выдачи материальных ценностей на нужды учреждения",
		"Ведомость выдачи ОС (ф. 0504210) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504102",
		"Накладная на внутреннее перемещение объектов нефинансовых активов",
		"Накладная на внутреннее перемещение объектов НФА (ф. 0504102) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504102_103н",
		"Накладная на внутреннее перемещение объектов нефинансовых активов",
		"Накладная на внутреннее перемещение объектов НФА (ф.0504102) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504204",
		"Требование - накладная",
		"Требование - накладная (ф. 0504204) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504204_103н",
		"Требование - накладная",
		"Требование - накладная (ф.0504204) (ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504204_52н",
		"Требование - накладная",
		"Требование - накладная (ф.0504204) (ред. 52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504205_103н",
		"Накладная на отпуск материалов на сторону",
		"Накладная на отпуск материалов на сторону (ф. 0504205) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504205_103н_ПоСебестоимости",
		"Накладная на отпуск материалов на сторону",
		"Накладная на отпуск материалов на сторону (ф. 0504205) (52н, ред. 103н) по себестоимости");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504205_52н",
		"Накладная на отпуск материалов на сторону",
		"Накладная на отпуск материалов на сторону (ф. 0504205) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0504205_52н_ПоСебестоимости",
		"Накладная на отпуск материалов на сторону",
		"(устарел) Накладная на отпуск материалов на сторону (ф. 0504205) (52н) по себестоимости");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0510450",
		"Накладная на внутреннее перемещение объектов нефинансовых активов",
		"Накладная на внутреннее перемещение НФА (ф. 0510450) (61н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Накладная0510458_157н",
		"Накладная на отпуск материальных ценностей на сторону",
		"Накладная на отпуск материальных ценностей на сторону (ф. 0510458) (61н, ред. 157н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ПриходныйОрдер0504207_103н",
		"Приходный ордер",
		"Приходный ордер (ф. 0504207) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ПриходныйОрдер0504207_52н",
		"Приходный ордер",
		"Приходный ордер (ф. 0504207) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"СписаниеБСО0504816_103н",
		"Акт о списании бланков строгой отчетности",
		"Акт списания БСО, ред.103н");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"СписаниеБСО_52н",
		"Акт о списании бланков строгой отчетности",
		"Акт списания БСО, ред.52н");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Справка0504833",
		"Бухгалтерская справка",
		"Справка ф. 0504833 (развернутая)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"Справка0504833_52",
		"Бухгалтерская справка",
		"Справка ф. 0504833");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ТребованиеНакладная0504204_103н",
		"Требование - накладная",
		"Требование-накладная (ф. 0504204) (52н, ред. 103н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ТребованиеНакладная0504204_52н",
		"Требование - накладная",
		"Требование-накладная (ф. 0504204) (52н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ТребованиеНакладная0510451_100н",
		"Требование - накладная",
		"Требование - накладная (ф. 0510451) (61н, ред. 100н)");
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"ф0504144_52н",
		"Акт о списании исключенных объектов библиотечного фонда",
		"Акт о списании литературы (ф. 0504144) (52н)");	
	ДобавитьОписаниеПервичногоДокумента(ПервичныеДокументы,
		"СведенияОПризнанииОбъектовПраваПользования0510478",
		"Сведения о признании объектов права пользования нефинансовыми активами",
		"Сведения о признании объектов права пользования НФА (ф. 0510478)");
КонецПроцедуры

// Новый описание первичных документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый описание первичных документов:
// * Идентификатор - Строка - 
// * ВидПервичногоДокумента - Строка - 
// * Наименование - Строка - 
Функция НовыйОписаниеПервичныхДокументов()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор",
		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	Результат.Колонки.Добавить("ВидПервичногоДокумента",
		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	Результат.Колонки.Добавить("Наименование",
		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	Возврат Результат;
КонецФункции

// Пустая строка параметра печатных форм.
// 
// Возвращаемое значение:
//  Структура - Пустая строка параметра печатных форм:
// * Представление - Строка -
// * ВидПервичногоДокумента - СправочникСсылка.ПервичныеДокументы
// * УсловияВидимости - Массив из Строка
Функция ПустаяСтрокаПараметраПечатныхФорм()
	Результат = Новый Структура;
	Результат.Вставить("Представление", "");
	Результат.Вставить("ВидПервичногоДокумента", ПредопределенноеЗначение("Справочник.ПервичныеДокументы.ПустаяСсылка"));
	Результат.Вставить("УсловияВидимости", Новый Массив);
	Возврат Результат;
КонецФункции

#Область ОбновлениеИнформационнойБазы

// Многопоточный обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//  ТипДокумента - Тип
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры, ТипДокумента) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДокумента);
	// Параметры выборки данных для многопоточного обновления.
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ОбъектМетаданных.ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Дата");
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Дата");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	АктуальныеДанные = Параметры.АктуальныеДанные;
	АктуальныеДанные.ПолеОтбора = "Дата";
	АктуальныеДанные.ВидСравнения = ВидСравнения.Больше;
	АктуальныеДанные.Значение = Дата("20231231235959");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка
	|ИЗ
	|	#ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ПервичныйДокумент = ЗНАЧЕНИЕ(Справочник.ПервичныеДокументы.ПустаяСсылка)
	|	И ТаблицаДокумента.УдалитьИдентификаторПечатнойФормы <> """"";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаДокумента", ОбъектМетаданных.ПолноеИмя());
	
	ДокументыКОбработке = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		ДокументыКОбработке.Добавить(Выборка.Ссылка);
		Если Счетчик = 1000 Тогда
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДокументыКОбработке);
			ДокументыКОбработке.Очистить();
			Счетчик = 0;
		КонецЕсли;
	КонецЦикла;
	
	Если Счетчик > 0 Тогда
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДокументыКОбработке);
	КонецЕсли;
	
КонецПроцедуры

// Парный обработчик к процедуре ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
// 
// Параметры:
//  Параметры - Структура:
//   * ОбработкаЗавершена - Булево
//  ТипДокумента - Тип
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры, ТипДокумента) Экспорт
	
	// Выборка данных для многопоточного обновления.
	ОбрабатываемыеДокументы = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);

	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДокумента);
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Для каждого ОбрабатываемыйДокумент Из ОбрабатываемыеДокументы Цикл
		ПредставлениеСсылки = Строка(ОбрабатываемыйДокумент.Ссылка);
		Попытка
			//@skip-check query-in-loop
			ОбработатьДокументПриОбновлении(ОбрабатываемыйДокумент, ОбъектМетаданных);
			ОбъектовОбработано = ОбъектовОбработано + 1;
		Исключение
			// Если не удалось обработать какой-либо документ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ПредставлениеСсылки);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				ОбъектМетаданных,
				ОбрабатываемыйДокумент.Ссылка,
				ТекстСообщения);
		КонецПопытки;
		
	КонецЦИкла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать некоторые ""%2"" (пропущены): %1'"), 
			ПроблемныхОбъектов,
			ПолноеИмяОбъекта);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			ОбъектМетаданных,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Обработана очередная порция ""%2"": %1'"),
				ОбъектовОбработано,
				ПолноеИмяОбъекта));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДокументПриОбновлении(ОбрабатываемыйДокумент, ОбъектМетаданных)
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ОбъектМетаданных.ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ОбрабатываемыйДокумент.Ссылка);
		Блокировка.Заблокировать();
		
		ДокументОбъект = ОбрабатываемыйДокумент.Ссылка.ПолучитьОбъект(); // ДокументОбъект
		ДокументОбъект.Заблокировать();

		Если Не ЗначениеЗаполнено(ДокументОбъект.ПервичныйДокумент) Тогда
			Если ДокументОбъект.УдалитьИдентификаторПечатнойФормы = "ДокументКонтрагента" Тогда
				ДокументОбъект.ПервичныйДокумент = ПервичныйДокументДокументКонтрагента();
			Иначе
				ДокументОбъект.ПервичныйДокумент = НайтиПоИдентификатору(
					ДокументОбъект.УдалитьИдентификаторПечатнойФормы);
			КонецЕсли;		
		КонецЕсли;		
		
		Если ДокументОбъект.Модифицированность() Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		Иначе
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ОбрабатываемыйДокумент.Ссылка);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
